// 009_Semicolon.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    // 하나의 문법단위
    // 즉 xx한 일을 해라라는 마무리로 쓰이게 되고
    // 이 마무리가 없다면 컴파일러는 
    // 연결된 코드로 동시에 실행되어야 한다고 생각하고 읽어요

    // 변수명이나 메모리명의 첫번째 글자로 숫자를 사용할수 없습니다.
    // int 1Value = 10;
    
    // ; 여기까지의 코드를 마무리 짓는다인데.
    // int Value를 만들고 거기에 10을 넣고
    // 이 코드를 마무리 지어라.
    // ; 그리고 다음코드가 있다면 다음코드를 실행해라.
    int Value = 10;
    
    ;
    ;;;;;;;;
    // 그래서 마무리 지으면 안되는 순간에 
    // 마무리를 사용에 주의가 필요합니다.

    // std::cout << "Hello World!\n";
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
