// 003_MainFunction.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//
#include <iostream>

// 객체지향 프로그밍을 배우게 될건데.
// 객체지향?
// 절차지향?

// 코드라는건 컴퓨터에게 무슨일을 시키는것.
// 그건 무조건 순서가 있어야 합니다.
// 절차지향이건
// 객체지향이건
// 함수형이건
// ...을 실행하라는 말이 된다.
// 프로그램을 실행할거야.
// 진입점이라고 합니다.


// 진입점에서부터 실행흐름이 생긴다.
// 이 실행흐름을 함수라고 부르기로 했다.
int main() // <= int main() 진입점으로 하기로 모두가 합의했어요
{ // 함수의 시작
    // 한달뒤에 설명하게 될것이다.
    std::cout << "Hello World!\n";

	while (true)
	{

	}
} // 함수의 끝
// 이러이러할거다.

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
